Revit 2027 API
Application.BackgroundColor Property
 The background color to use for model views in this session.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color BackgroundColor { get; set; }
Public Property BackgroundColor As Color
	Get
	Set
public:
property Color^ BackgroundColor {
	Color^ get ();
	void set (Color^ value);
}
member BackgroundColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The backgroundColor argument does not represent a valid color.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace